# CurveSelector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalModelSelector..::..CurveSelector Property
AnalyticalModelSelector Class See Also
---
The portion of the curve to be selected.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalyticalCurveSelector CurveSelector { get; set; }
```

Visual Basic
---
```text
Public Property CurveSelector As AnalyticalCurveSelector
	Get
	Set
```

Visual C++
---
```text
public:
property AnalyticalCurveSelector CurveSelector {
	AnalyticalCurveSelector get ();
	void set (AnalyticalCurveSelector value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModelSelector Class
Autodesk.Revit.DB.Structure Namespace